trade_exp/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладДляБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеРазрешеноРедактированиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b6b1d28-2274-4089-bbe0-1f892b513c41">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31714690-5baf-46f1-b063-d29c311537f8">
    <name>ТорговыйЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da19460-b28a-45da-95fc-40a81653f323">
    <name>СкрытьКоличествоУчетаВПересчетах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efdd8d42-ae41-4592-8382-d99891278ded">
    <name>ТипСкладаПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad05e83-cd86-4595-b1cd-604ad5d18c31">
    <name>ДопСкладПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9d13f0-85a3-4086-9203-6e34b242f14b">
    <name>ОтправкаУведомлений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3d49e10-572c-4e29-a20e-727c92be2a9e">
    <name>ПовторноеУведомление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57e1c5a7-2f3b-451e-b301-5b891fe6cb38">
    <name>ТелефонПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="682997ea-3be2-4a30-8770-7535fef1dbdd">
    <name>EMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6500dc86-8583-4657-936f-1ccc78a87015">
    <name>ДопEMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93e0d2a6-ba2b-4dd6-9aa3-ef4cbd740848">
    <name>УведомлятьВБитриксОПоступлениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d5793ec-4952-45ae-ba13-3ea772eca4ae">
    <name>УведомлятьВБитриксОСписанииПодотчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2354dc18-0c64-42c5-8971-6e5307b195f6">
    <name>ИндивидуальныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/Склады/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ОтображениеНайстроекДляПодрядчика();
	
КонецПроцедуры

&НаСервере
Процедура Док_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если не  объект.Родитель.Пустая() Тогда  
		Если объект.Родитель.ПринадлежитЭлементу(ГруппаПодрядчики) ИЛИ объект.Родитель = ГруппаПодрядчики Тогда 

		Если Не ЗначениеЗаполнено(Объект.ТелефонПодрядчика) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполенено поле контактной информации";
			Сообщение.Поле = "Объект.ТелефонПодрядчика";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.EMAILподрядчика) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполенено поле контактной информации";
			Сообщение.Поле = "Объект.EMAILподрядчика";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
		
		Элементы.НастройкаУведомленийПодрядчику.Доступность = ИСТИНА;
		Элементы.НастройкаУведомленийПодрядчику.Видимость = ИСТИНА;
		
		КонецЕсли;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	ОтображениеНайстроекДляПодрядчика();
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеНайстроекДляПодрядчика() 
	
	ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если не  объект.Родитель.Пустая() Тогда  
		Если объект.Родитель.ПринадлежитЭлементу(ГруппаПодрядчики) ИЛИ объект.Родитель = ГруппаПодрядчики Тогда 
			Элементы.НастройкаУведомленийПодрядчику.Доступность = ИСТИНА;
			Элементы.НастройкаУведомленийПодрядчику.Видимость = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
	

КонецПроцедуры
